class Suggestion {
  final String title, description;
  Suggestion({required this.title, required this.description});
  @override
  String toString() => 'Suggestion(title: $title, description: $description)';

  static List<Suggestion> suggestions = [
    Suggestion(
      title: "رژیم غذایی سالم بخورید",
      description:
          "خوردن یک رژیم غذایی سالم شامل میوه ها، سبزیجات، غلات کامل، پروتئین بدون چربی و لبنیات کم چرب است. این به شما کمک می کند تا وزن سالم خود را حفظ کنید، از بیماری های قلبی و دیابت جلوگیری کنید و سیستم ایمنی قوی داشته باشید.",
    ),
    Suggestion(
      title: "ورزش منظم داشته باشید",
      description:
          "بزرگسالان باید حداقل 150 دقیقه فعالیت بدنی متوسط ​​یا 75 دقیقه فعالیت بدنی شدید در هفته داشته باشند. کودکان و نوجوانان باید حداقل 60 دقیقه فعالیت بدنی متوسط ​​در روز داشته باشند. ورزش به شما کمک می کند تا وزن سالم خود را حفظ کنید، از بیماری های قلبی و دیابت جلوگیری کنید، استرس را کاهش دهید و خلق و خوی خود را بهبود ببخشید.",
    ),
    Suggestion(
      title: "سیگار نکشید",
      description:
          "سیگار کشیدن یکی از مضرترین عادت های زندگی است. سیگار کشیدن می تواند باعث بیماری های قلبی، سرطان و سایر بیماری های جدی شود. اگر سیگار می کشید، ترک کنید. ترک سیگار یکی از بهترین کارهایی است که می توانید برای سلامتی خود انجام دهید.",
    ),
    Suggestion(
      title: "حداقل 7-8 ساعت در شب بخوابید",
      description:
          "خواب برای سلامتی جسمی و روانی شما ضروری است. وقتی به اندازه کافی نمی خوابید، بیشتر در معرض بیماری، تصادف و سایر مشکلات سلامتی هستید.",
    ),
    Suggestion(
      title: "استرس خود را مدیریت کنید",
      description:
          "استرس می تواند تأثیر منفی بر سلامت شما داشته باشد. راه های مختلفی برای مدیریت استرس وجود دارد، مانند ورزش، مدیتیشن و یوگا.",
    ),
    Suggestion(
      title: "واکسیناسیون را دریافت کنید",
      description:
          "واکسن ها می توانند شما را در برابر بیماری های جدی مانند دیفتری، کزاز و فلج اطفال محافظت کنند. اگر واکسن هایی را دریافت نکرده اید، با پزشک خود صحبت کنید تا ببینید کدام واکسن ها برای شما مناسب هستند.",
    ),
    Suggestion(
      title: "معاینات منظم پزشکی داشته باشید",
      description:
          "مهم است که برای غربالگری و تشخیص زودهنگام بیماری ها، معاینات منظم پزشکی داشته باشید. با پزشک خود در مورد برنامه غربالگری مناسب برای سن و سلامت شما صحبت کنید.",
    ),
    Suggestion(
      title: "مراقب سلامت روان خود باشید",
      description:
          "سلامت روان به همان اندازه سلامت جسمی مهم است. اگر احساس افسردگی، اضطراب یا سایر مشکلات سلامت روان دارید، به دنبال کمک باشید. راه های مختلفی برای درمان سلامت روان وجود دارد، مانند دارو درمانی، درمان صحبت کردن و درمان گروهی.",
    ),
  ];
}
